{
    "_": "Message",
    "id": 14,
    "peer_id": {
        "_": "PeerChannel",
        "channel_id": 1320526773
    },
    "date": "2020-09-10 19:51:10+00:00",
    "message": "More than 100 scientific journals have disappeared from the Internet\nhttps://www.nature.com/articles/d41586-020-02610-z",
    "out": true,
    "mentioned": false,
    "media_unread": false,
    "silent": false,
    "post": true,
    "from_scheduled": false,
    "legacy": false,
    "edit_hide": false,
    "pinned": false,
    "from_id": null,
    "fwd_from": null,
    "via_bot_id": null,
    "reply_to": null,
    "media": {
        "_": "MessageMediaWebPage",
        "webpage": {
            "_": "WebPage",
            "id": 7937820127058111730,
            "url": "https://www.nature.com/articles/d41586-020-02610-z",
            "display_url": "nature.com/articles/d41586-020-02610-z",
            "hash": 1773133001,
            "type": "photo",
            "site_name": "Nature",
            "title": "More than 100 scientific journals have disappeared from the Internet",
            "description": "Researchers have identified dozens of open-access journals that went offline between 2000 and 2019, and hundreds more that could be at risk.",
            "photo": {
                "_": "Photo",
                "id": 5970830150574648175,
                "access_hash": 763873047049234393,
                "file_reference": "b'\\x00a\\xed\\xb7`\\xe9\\xe4\\xba|Q\\x88\\x12\\x13\\xcb\\xb8\\xeb\\xb6\\x86\\xc8\\xf5V'",
                "date": "2020-09-11 15:10:37+00:00",
                "sizes": [
                    {
                        "_": "PhotoStrippedSize",
                        "type": "i",
                        "bytes": "b'\\x01\\x17(\\x9e\\x90\\xe7 (\\xcb\\x1e\\x94\\xb4\\x8av\\xcd\\x9c\\xe3\\x8e\\xb4\\xd9\\x94U\\xd8\\xef)\\xc2\\x96.\\x06=\\xb8\\xa6#\\xee\\x1e\\xf5\\x11v\\x7f\\x99\\x8e\\xec\\x1e\\xfd\\xeac\\x8f7\\x8e\\x98\\xa9L\\xd2QV\\x1f\\xc6\\xdfz)(\\xab1\\x12\\x9a\\xca\\x1csE\\x14t\\x05&\\xb5B\\xfc\\xdd@L\\x9e\\xf8\\xa5\\x03\\x03$\\xe4\\x9e\\xa6\\x8a)$T\\xa4\\xda\\x16\\x8a(\\xa6I'"
                    },
                    {
                        "_": "PhotoSize",
                        "type": "m",
                        "w": 320,
                        "h": 180,
                        "size": 8718
                    },
                    {
                        "_": "PhotoSize",
                        "type": "x",
                        "w": 800,
                        "h": 450,
                        "size": 30951
                    },
                    {
                        "_": "PhotoSize",
                        "type": "y",
                        "w": 1024,
                        "h": 576,
                        "size": 49840
                    }
                ],
                "dc_id": 4,
                "has_stickers": false,
                "video_sizes": []
            },
            "embed_url": null,
            "embed_type": null,
            "embed_width": null,
            "embed_height": null,
            "duration": null,
            "author": "Diana Kwon",
            "document": null,
            "cached_page": {
                "_": "Page",
                "url": "https://www.nature.com/articles/d41586-020-02610-z",
                "blocks": [
                    {
                        "_": "PageBlockTitle",
                        "text": {
                            "_": "TextPlain",
                            "text": "More than 100 scientific journals have disappeared from the Internet"
                        }
                    },
                    {
                        "_": "PageBlockSubtitle",
                        "text": {
                            "_": "TextPlain",
                            "text": "Researchers have identified dozens of open-access journals that went offline between 2000 and 2019, and hundreds more that could be at risk."
                        }
                    },
                    {
                        "_": "PageBlockAuthorDate",
                        "author": {
                            "_": "TextPlain",
                            "text": "Diana Kwon"
                        },
                        "published_date": "2020-09-10 00:00:00+00:00"
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "Scholarly journals are supposed to provide a lasting record of science. But over the past two decades, 176 open-access journals — and many of the papers published in them — have disappeared from the Internet, according to an analysis published on 27 August ["
                                },
                                {
                                    "_": "TextSuperscript",
                                    "text": {
                                        "_": "TextUrl",
                                        "text": {
                                            "_": "TextPlain",
                                            "text": "1"
                                        },
                                        "url": "https://www.nature.com/articles/d41586-020-02610-z#ref-CR1",
                                        "webpage_id": 0
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": "]."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "“There shouldn’t really be any decay or loss in scientific publications, particularly those that have been open on the web,” says Mikael Laakso, an information scientist at the Hanken School of Economics in Helsinki, and a co-author of the study, which was posted on the arXiv preprint server. He and his colleagues identified 176 titles whose online presence vanished between 2000 and 2019."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "More than half of these journals were in the social sciences and humanities, although life sciences, health sciences, physical sciences and mathematics were also represented. Eighty-eight of the journals were affiliated with a scholarly society or a research institution. The analysis also identified 900 journals that are still online but seem to have stopped publishing papers, so might be vulnerable to vanishing in the near future."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "The study lays out a \"compelling case\" for the vulnerability of online journals, says Elizabeth Lightfoot, a librarian at Florida International University in Miami."
                        }
                    },
                    {
                        "_": "PageBlockHeader",
                        "text": {
                            "_": "TextPlain",
                            "text": "Vanishing journals"
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Journals can disappear from the Internet for a number of reasons, says Laakso. The publisher might stop paying to keep its publication’s webpage afloat, for example, or journals might be hosted on an online platform that belongs to an academic institution and is left behind when the site or server is updated."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Journals are supposed to be preserved in digital archives when this happens. Services such as the LOCKSS (Lots of Copies Keep Stuff Safe) Program, which was launched by Stanford Libraries in 1999, aim to ensure that publications remain available even when the publisher is no longer around. LOCKSS works by making multiple copies of content that is stored on the servers of participating libraries, who pay an annual fee to have their collections preserved. Similar initiatives, including CLOCKSS, Portico and the Public Knowledge Project’s Preservation Network (PKP PN), have emerged over the past two decades. These vary in cost and coverage: Some work with libraries, others with publishers — services such as PKP PN are free for journals that sign up. Tens of thousands of titles are currently curated in such preservation schemes. But, Laakso says, there are dozens of journals that fall through the cracks."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Pinning down whether a journal is truly unavailable online is a challenge, because there is no single database that tracks the activity of open-access journals, says Lisa Matthias, one of the authors of the study and a PhD student at the Free University of Berlin. Databases such as the Directory of Open Access Journals (DOAJ) don’t keep track of journals that no longer publish — and journals that cease publishing or stop maintaining their presence on the web usually do so silently."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "To find out how many journals had vanished, the team manually collected historical data from several lists of titles, including the DOAJ, Ulrichsweb and Scopus. Then they checked to see if any of the titles they identified were listed on the Keepers Registry, which keeps track of journals that are enrolled into digital preservation schemes. Finally, they went to the Internet Archive’s Wayback Machine to access snapshots of now-offline journals’ websites to see when they had last published, and when the content was last available on the Internet. Journals were considered “vanished” if less than 50% of their content was still freely available online (the researchers acknowledge that some journals could exist in print form or behind a paywall)."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "The majority of the 176 vanished journals had disappeared within 5 years of becoming inactive — the point at which they stopped publishing papers. Around one-third of them disappeared within one year of the last publication. The researchers used this ‘life cycle’ to estimate that another 900 inactive open-access journalscould be at risk of vanishing."
                        }
                    },
                    {
                        "_": "PageBlockHeader",
                        "text": {
                            "_": "TextPlain",
                            "text": "Preserving the literature"
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Subscription journals were not included in the study, Laakso says, because paywalls mean that they would have had to have used a different method to collect the data. He adds that because of this and other limitations, the study probably underestimates the number of journals that have disappeared. “It’s really hard to pin down when something doesn't absolutely exist, but we tried our best,” Laakso says. “We hope that there will be more refined and automatic ways to detect these in the future.”"
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Thib Guicherd-Callin, the acting manager of the LOCKSS Program, says it’s not surprising that there are journals that aren't captured by existing preservation services. Although many groups have used the open-source LOCKSS software, efforts to launch digital preservation initiatives are still “woefully underfunded”, he adds. “The desire to preserve these at-risk works is there,” he adds, but few institutions are investing the resources necessary to identify these publications and make sure they’re included in a digital preservation scheme."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Matthias says that the responsibility for ensuring inactive journals don’t disappear should be shared between publishers, authors, librarians and preservation services. Lightfoot agrees that a coordinated and collaborative effort is necessary. However, she adds, “the twin challenges of what that effort might look like and who would fund it make the pathway forward murky at best”."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "doi: 10.1038/d41586-020-02610-z"
                        }
                    },
                    {
                        "_": "PageBlockHeader",
                        "text": {
                            "_": "TextPlain",
                            "text": "References"
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "1. "
                                },
                                {
                                    "_": "TextAnchor",
                                    "text": {
                                        "_": "TextEmpty"
                                    },
                                    "name": "ref-CR1"
                                },
                                {
                                    "_": "TextPlain",
                                    "text": "Laakso, M., Matthias, L. & Jahn, N. Preprint at "
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "https://arxiv.org/abs/2008.11933"
                                    },
                                    "url": "https://arxiv.org/abs/2008.11933",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " (2020)."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockRelatedArticles",
                        "title": {
                            "_": "TextEmpty"
                        },
                        "articles": [
                            {
                                "_": "PageRelatedArticle",
                                "url": "http://www.nature.com/articles/d41586-020-02660-3",
                                "webpage_id": 7937820127511488152,
                                "title": "Illustration: get your research the attention it deserves",
                                "description": "Three scientific artists explain how to create impact with attractive visuals.",
                                "photo_id": 6011648274215316307,
                                "author": "Andy Tay",
                                "published_date": "2020-09-24 00:00:00+00:00"
                            },
                            {
                                "_": "PageRelatedArticle",
                                "url": "http://www.nature.com/articles/d41586-020-02669-8",
                                "webpage_id": 7937820125559182486,
                                "title": "Censored: Australian scientists say suppression of environment research is getting worse",
                                "description": "Survey finds that many researchers are banned from speaking about their work or have had their research altered to downplay risks.",
                                "photo_id": 6002666995088206579,
                                "author": "Dyani Lewis",
                                "published_date": "2020-09-21 00:00:00+00:00"
                            },
                            {
                                "_": "PageRelatedArticle",
                                "url": "http://www.nature.com/articles/d41586-020-02580-2",
                                "webpage_id": 7937820126058873788,
                                "title": "A guide to the Nature Index",
                                "description": "A description of the terminology and methodology used in this supplement, and a guide to the functionality available free online at natureindex.com.",
                                "photo_id": null,
                                "author": null,
                                "published_date": "2020-09-19 00:00:00+00:00"
                            }
                        ]
                    }
                ],
                "photos": [
                    {
                        "_": "Photo",
                        "id": 6011648274215316307,
                        "access_hash": 3133030998143571142,
                        "file_reference": "b'\\x00a\\xed\\xb7`k\\xad\\\\\\xf6\\x9f\\xfbE\\xa7\\x9b\\xc6\\xb9\\x01\\x0f^z\\xf3'",
                        "date": "2020-09-24 10:10:01+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b\"\\x01\\x17(\\xd7b\\xc1~Q\\x93\\xe9\\x9a\\x8e)\\xc4\\x8eP\\xa3#\\x0e\\xc7\\xbdML(:\\x8e\\x0f\\xad\\x00>\\x8a\\xab9\\x95d]\\xae0{\\x11\\x81\\xf8\\xd4\\x03Px\\xdb\\x12*0\\xff\\x00\\xa6m\\x93@\\x17\\x8e\\xff\\x004c\\x1b1\\xcd\\x14\\xd8\\xa6\\xf3FB:\\x8fq\\x8a(\\x02N}\\xa8\\xc0'$sE\\x14\\x00\\x15S\\xd4\\x03\\xf5\\xa8\\xe3\\x81#$\\xa8\\xe4\\x9c\\xf2:QE\\x00KE\\x14P\\x07\""
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 180,
                                "size": 9340
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 800,
                                "h": 450,
                                "size": 39288
                            },
                            {
                                "_": "PhotoSize",
                                "type": "y",
                                "w": 1024,
                                "h": 576,
                                "size": 58335
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    },
                    {
                        "_": "Photo",
                        "id": 6002666995088206579,
                        "access_hash": -2965966350565425804,
                        "file_reference": "b'\\x00a\\xed\\xb7`\\xc4\\x99\\xc6\\xe1\\x11\\x08\\xaa-2\\x03\\xf77Y\\xfa\\x0c\\x05'",
                        "date": "2020-09-21 13:36:21+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b'\\x01\\x17(p\\'\\xbe)\\x0bv\\xce)Y[q\\x01\\x80\\x1e\\xb8\\xa6\\xed@\\xdc\\xb9f\\xf4\\xa2\\xc3\\x0f3\\x1d\\xf8\\xf74\\x85\\xc1\\xe8O\\xe1Ry|d\\xf0=qDA\\x90\\x168\\xcfl\\xd0\"\\x1d\\xe9\\xb0\\x9c\\x90\\xd4T\\x84\\x19\\x1f.\\x8a\\x17\\xd7\\x14S\\xb8Xs|\\x92g\\xa9\\xefJ_h\\xdcp\\xbe\\xfdM\\x14T\\x8chm\\xe3\\xe5\\xfc\\xcfZM\\xb8\\x1cr}M\\x14P\\x03L\\x80\\x8c\\x0e\\xbe\\xa6\\x8a(\\xa6\\x07'"
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 180,
                                "size": 23201
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 800,
                                "h": 450,
                                "size": 111550
                            },
                            {
                                "_": "PhotoSize",
                                "type": "y",
                                "w": 1024,
                                "h": 576,
                                "size": 178701
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    }
                ],
                "documents": [],
                "part": false,
                "rtl": false,
                "v2": false,
                "views": null
            },
            "attributes": []
        }
    },
    "reply_markup": null,
    "entities": [
        {
            "_": "MessageEntityUrl",
            "offset": 69,
            "length": 50
        }
    ],
    "views": 45,
    "forwards": 0,
    "replies": null,
    "edit_date": null,
    "post_author": "Markt Mai",
    "grouped_id": null,
    "restriction_reason": [],
    "ttl_period": null,
    "tags": []
}