{
    "_": "Message",
    "id": 22,
    "peer_id": {
        "_": "PeerChannel",
        "channel_id": 1320526773
    },
    "date": "2020-09-16 15:04:37+00:00",
    "message": "What Germany teaches the world in a crisis\nhttps://www.ft.com/content/a5d516b5-eff8-4f6f-841f-1fed303e4395",
    "out": true,
    "mentioned": false,
    "media_unread": false,
    "silent": false,
    "post": true,
    "from_scheduled": false,
    "legacy": false,
    "edit_hide": true,
    "pinned": false,
    "from_id": null,
    "fwd_from": null,
    "via_bot_id": null,
    "reply_to": null,
    "media": {
        "_": "MessageMediaWebPage",
        "webpage": {
            "_": "WebPage",
            "id": 707176889799233338,
            "url": "https://www.ft.com/content/a5d516b5-eff8-4f6f-841f-1fed303e4395",
            "display_url": "ft.com/content/a5d516b5-eff8-4f6f-841f-1fed303e4395",
            "hash": -1984708882,
            "type": "photo",
            "site_name": "Ft",
            "title": "What Germany teaches the world in a crisis",
            "description": "Europe’s largest economy has overcome huge challenges in recent decades. John Kampfner goes in pursuit of its secret and finds telling lessons for the fight against Covid",
            "photo": {
                "_": "Photo",
                "id": 5986469213126109931,
                "access_hash": -4663635123571693355,
                "file_reference": "b'\\x00b\\x11\\x83 \\xb3AS\\xefr\\xd3\\x0f\\xcf\\xb7^!\\xb6\\xd3\\xc3df'",
                "date": "2020-09-16 09:47:57+00:00",
                "sizes": [
                    {
                        "_": "PhotoStrippedSize",
                        "type": "i",
                        "bytes": "b'\\x01\\x17(\\xb9o\\x0cM\\x02\\x13\\x1a\\x92G\\\\T\\x8f\\r\\xba!gD\\n\\x06I\"\\xa3\\x8ad\\x8a\\xd1Y\\xd8\\x00\\xab\\xcdR\\xbdy\\xaeg0\\xa9\\x0b\\x0f\\x07\\xeb\\xf5\\xa5\\xa2We\\xb6\\xf9\\x9e\\xa4\\xed\\x02<\\xc0*\\x80\\x0ca\\xb1\\xe9NXS;Z1\\x9f\\xa5>\\x1c\\x19\\xd7\\xfe\\xb9\\n\\x92V]\\xe9\\x19\\xea\\xd9\\xc7\\xb6\\x054\\x12oMJ\\xf3B\\x8b\\x13\\x10\\x80`zQR\\\\\\x12 uoN\\r\\x15.\\xc7E\\x06\\xec\\xf5(L\\xfee\\xaf\\x94\\t\\xe7\\x152\\\\(\\x03\\x93\\x9f~\\xb4QE\\xc9t\\xe2\\xdb\\x08\\xa7\\n\\xe0\\xb3c\\xe4\\x03\\xa6jC:y\\xcb&\\xfe\\x83\\x1fv\\x8a)\\\\\\xa7J?\\x81\\x1b\\xdc\\xef\\x13\\xa9l\\x83\\x8d\\xbc{QE\\x14\\x9b\\xd4\\xa8A$\\x7f'"
                    },
                    {
                        "_": "PhotoSize",
                        "type": "m",
                        "w": 320,
                        "h": 180,
                        "size": 13443
                    },
                    {
                        "_": "PhotoSize",
                        "type": "x",
                        "w": 800,
                        "h": 450,
                        "size": 48384
                    },
                    {
                        "_": "PhotoSize",
                        "type": "y",
                        "w": 900,
                        "h": 506,
                        "size": 38711
                    }
                ],
                "dc_id": 4,
                "has_stickers": false,
                "video_sizes": []
            },
            "embed_url": null,
            "embed_type": null,
            "embed_width": null,
            "embed_height": null,
            "duration": null,
            "author": "John Kampfner",
            "document": null,
            "cached_page": {
                "_": "Page",
                "url": "https://www.ft.com/content/a5d516b5-eff8-4f6f-841f-1fed303e4395",
                "blocks": [
                    {
                        "_": "PageBlockTitle",
                        "text": {
                            "_": "TextPlain",
                            "text": "What Germany teaches the world in a crisis"
                        }
                    },
                    {
                        "_": "PageBlockSubtitle",
                        "text": {
                            "_": "TextPlain",
                            "text": "Europe’s largest economy has overcome huge challenges in recent decades. John Kampfner goes in pursuit of its secret and finds telling lessons for the fight against Covid"
                        }
                    },
                    {
                        "_": "PageBlockAuthorDate",
                        "author": {
                            "_": "TextPlain",
                            "text": "John Kampfner"
                        },
                        "published_date": "2020-09-16 04:00:57+00:00"
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "In Berlin, a middle-aged couple wanted to put a disused building to good use. The city government had just taken over a former psychiatric clinic close to their house to turn it into a dormitory for 400 Syrians and other refugees. Instead of complaining, Hardy Schmitz and Barbara Burckhardt got permission to take over the first floor of a beautiful villa that had been empty for 15 years to turn it into a workshop and meeting place for these new arrivals. "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Their business plan was clear. Their credentials — he a successful entrepreneur, she a well-known theatre critic — were impeccable. The only problem was the neighbours. The fine burghers of this affluent part of Charlottenburg sent out a flyer complaining about the project. Just think of the reputation of your street. Think of your daughters’ safety. You wouldn’t be able to walk home at night. As for house prices . . . "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "The project was threatened with a lawsuit, something not to be dismissed lightly. Burckhardt started a group to try to see them off. “We posted opposing flyers in which we wrote, ‘If we can’t do it, then who can?’,” she tells me. She called in favours from actors, impresarios and writers to give talks or introduce films or music soirées. She invited the neighbours to these events, together with the refugees. The chance to rub shoulders with cultural celebrity was too good to miss; resistance folded. Many of the volunteers were elderly ladies, working alongside mostly Arab men in their twenties. There were some intercultural teething problems. Should they serve alcohol in the evenings?"
                        }
                    },
                    {
                        "_": "PageBlockPhoto",
                        "photo_id": 5984202943567604607,
                        "caption": {
                            "_": "PageCaption",
                            "text": {
                                "_": "TextPlain",
                                "text": "Refugees and Germans attend an integration seminar in Weimar in 2016 © New York Times/Redux/eyevine"
                            },
                            "credit": {
                                "_": "TextEmpty"
                            }
                        },
                        "url": null,
                        "webpage_id": null
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "Five years ago Angela Merkel declared after visiting a refugee holding camp: "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "“Wir schaffen das”,"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " we can handle it. Germany allowed in 1m of the world’s most destitute. One word epitomised the moment: "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Willkommenskultur"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ", welcome culture. Of course, there have been problems. The issue provided fuel to the rightwing AfD party and its politics of grievance, racism and populism. But in the first few months, just over half the German population over the age of 16 got involved in one way or another to help the refugees."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Another even more momentous anniversary beckons. On October 3, Germany will mark 30 years since reunification. "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "In mid-1989 I arrived in East Berlin as the Telegraph’s first (and last) correspondent to the German Democratic Republic. The system was on the ropes; the economy was teetering; demonstrations were taking place in several cities. What happened next was not inevitable. East Germany’s leaders had praised the crackdown on Tiananmen Square a few months earlier. Yet crucially, nobody was killed. Over the next year, a system was dismantled, peacefully. Those of the more nostalgic disposition who talk of a dignity denied by reunification might need reminding what the old East Germany was like: towns disfigured by above-ground pipes and shrouded in black smog, lower life expectancy. And the Wall."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Even now many people refuse to see reunification as a cause for celebration. It was not without its mistakes, of course — the insensitivity of the Treuhand privatisation body, the arrogance of Wessis, the refusal to adopt even the odd advantage of the GDR such as women’s rights. The AfD continues to play on the grievance agenda. Its popularity has waned during Covid-19, but renewed dangers lurk from a protracted recession."
                        }
                    },
                    {
                        "_": "PageBlockPhoto",
                        "photo_id": 5986735720141794195,
                        "caption": {
                            "_": "PageCaption",
                            "text": {
                                "_": "TextEmpty"
                            },
                            "credit": {
                                "_": "TextEmpty"
                            }
                        },
                        "url": null,
                        "webpage_id": null
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Yet, in spite of these problems (and more), I defy anyone to name any other nation that could have absorbed 17m poor neighbours with so little trauma? "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "Germans paid for "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Aufbau Ost"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " (Rebuilding the East) through a solidarity tax, the "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Soli"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ", a surcharge which only now is being phased out. They paid it with little fuss. It is estimated that by 2030 at the latest GDP per capita will have equalised. In any case, the differential between the once-decrepit East Germany and the West is less than it is between the north of England and London."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Good governance; high skills; solid public finances; regional strengths; social solidarity — and a new-found characteristic, compassion. The Germans have shown the world how these attributes help deal with the crises they have faced, of which Covid-19 is only the latest. "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "The measure of a country — or an institution or individual for that matter — is not the difficulties it faces, but how it surmounts them. On that test, contemporary Germany is a country to be envied. It has developed a maturity that few others can match."
                        }
                    },
                    {
                        "_": "PageBlockPhoto",
                        "photo_id": 5986438504109943619,
                        "caption": {
                            "_": "PageCaption",
                            "text": {
                                "_": "TextPlain",
                                "text": "A Berlin bookshop with a Union Jack and a display that reads ‘We still love you’ © Stefan Boness/Panos Pictures Panos"
                            },
                            "credit": {
                                "_": "TextEmpty"
                            }
                        },
                        "url": null,
                        "webpage_id": null
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "And what about us here on "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Die Insel"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ", the island, as Germans have taken to calling us? What can we learn? Does binary party-political confrontation produce good governance? Is our economy best served by a concentration of wealth and resources in one megacity? Do our regions have enough power and are the roles properly demarcated? Are we building and making the right things?"
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "As governments around the world rethink their economies and societies, as they think about reshaping education, the environment, towns and cities, could it be that the Germans have got there already?"
                        }
                    },
                    {
                        "_": "PageBlockDivider"
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextBold",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Since the start of 2019, I have been "
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": "revisiting Germany, looking more closely at the secrets of its success. Everyone I spoke to, whether prominent politicians and CEOs, artists, volunteers helping refugees, old mates and ordinary folk met at random, recoiled at the idea they have anything to teach the world. Germans are more comfortable talking about what they get wrong. Everywhere they look, they are fearful. They see a world in which democracy is openly mocked by populists and strongmen; they see the far-right everywhere. They, like nearly everyone, see the climate emergency before their eyes. "
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "I first met Merkel at the start of 1990. She was an unassuming adviser to the man who would become East Germany’s first and only democratically elected leader, Lothar de Maizière. We drank coffee together in the Palast der Republik, the parliament building in East Berlin, which controversially has since been pulled down. I was struck by her poise, restraint and calm when all around was chaos."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Exactly 30 years later and after 15 years as chancellor, she has risen to the Covid-19 challenge. She told citizens what she, her ministers and scientists knew and what they didn’t. She never blagged. Germany’s success in dealing with the crisis is due in part to Merkel’s style of leadership. But it is about more than that. It is about the role of the state and society. It is about social trust. "
                        }
                    },
                    {
                        "_": "PageBlockPhoto",
                        "photo_id": 5984330113254271883,
                        "caption": {
                            "_": "PageCaption",
                            "text": {
                                "_": "TextPlain",
                                "text": "German Chancellor Angela Merkel is joined by EU officials on a video-linked meeting with Chinese President Xi Jinping on Monday in Berlin © Getty Images"
                            },
                            "credit": {
                                "_": "TextEmpty"
                            }
                        },
                        "url": null,
                        "webpage_id": null
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Langsam aber sicher"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ", slow but sure, is the abiding principle that dominates public life. Create consensus where you can; value thoroughness in a politician over rhetorical flourishes. Everything in politics and public life is designed to mitigate risk."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "In a newspaper interview in 2004, shortly before becoming chancellor, Merkel was asked what emotions Germany aroused in her. She replied, “I am thinking of airtight windows. No other country can build such airtight and beautiful windows.” This is about more than buildings. It is a metaphor for constructing a country, a society, where reliability is the most prized asset. It has its downsides. Germany is slow to innovate. Broadband provision is in many places woeful (hence the desperation to opt for Huawei’s 5G). From cashless payments to e-government, it is a digital laggard. Society still cleaves towards the paternalistic employer. Entrepreneurialism does not sit easily."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "One illustrative anecdote from my time living in Bonn: I was sitting on the balcony of my apartment one sunny Sunday lunchtime listening to the local rock music station on the radio. When the pips came on for the news, my friend switched it off. I asked her to switch it back on. Didn’t I know it was the "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "quiet hour"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": "? During the quiet hour you have to show consideration to your elderly neighbours. You don’t need rules for that, I said. Oh yes you do, she snapped, you heartless Thatcherite. "
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "That story comes from the mid-1980s but little has changed since then. What has changed is that characteristics once disparaged by foreigners like me are now seen as positives. Germany shunned the excesses of Anglo-Saxon free markets (although it too has its fair share of corporate venality — think "
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "VW and emissions"
                                    },
                                    "url": "https://www.ft.com/content/aa12719e-deb9-11e9-b112-9624ec9edc59",
                                    "webpage_id": 707176889902496409
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ", think the "
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Wirecard scandal"
                                    },
                                    "url": "https://www.ft.com/content/bb22e179-cf1b-42d8-8d55-969bb177013c",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " now). It pursued a mix of economic growth and social inclusion long before this became fashionable in the Anglo-Saxon world. Germans work, but they also know when not to. "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Entschleunigung"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ", which means slowing down, or work-life balance. Not that this has damaged productivity — the object of envy for years."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "During and immediately after the financial crash of 2007-08, German companies did everything they could to avoid laying off workers. People were put on short-time work, told to bring forward annual leave, invited to take unpaid leave — anything not to disrupt the chain. Workers accepted the short-term sacrifices to keep their jobs. At the start of the pandemic, the government dusted down the scheme and put it back in place. It will continue for two years, shielding millions from unemployment."
                        }
                    },
                    {
                        "_": "PageBlockDivider"
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextBold",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "It can just about afford to do so. "
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": "Germany has an insurance policy that others do not possess. Years of the “"
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "black zero"
                                    },
                                    "url": "https://www.ft.com/content/d89d9404-c586-11e9-a8e9-296ca66511c9",
                                    "webpage_id": 707176889595968071
                                },
                                {
                                    "_": "TextPlain",
                                    "text": "”, the austerity requirement that the federal government and regions must balance their books, left the treasury with a huge surplus. That enabled Merkel and her cabinet to do a rapid about-turn and pump an initial €750bn to prop up the economy, a staggering amount but one it could more easily absorb than countries that had previously been more profligate. The same thinking underlies household spending. Most people find the notion of debt (the same word as guilt in the German language) socially embarrassing. Pretty much any surplus income goes into pensions and life insurance."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "More than 100m such policies have been bought — more than there are people. Unlike countries like the US and UK, Germans are not obsessed by the housing ladder. The ratio between earnings and assets has been far less out of kilter. Few people buy homes before they have children. They see no point, because rent is usually manageable, and homes are well maintained. One would rarely hear in polite society a discussion about profits to be made from “buy to let”. Those who indulge in such moneymaking ventures tend not to tell their friends about it. "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "Germany realised long before others that countries cannot be successful if regional imbalances are not tackled. The "
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextItalic",
                                        "text": {
                                            "_": "TextPlain",
                                            "text": "Mittelstand"
                                        }
                                    },
                                    "url": "https://www.ft.com/topics/organisations/Mittelstand",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " — the hundreds of thousands of small and medium-sized enterprises dotted around hundreds of small and medium-sized towns — employs around three-quarters of the country’s workforce and produces more than half the economic output. Manufacturing never became a dirty word. Advanced engineering is central to Germany’s sense of success — and of place. "
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockPhoto",
                        "photo_id": 5986618909916244748,
                        "caption": {
                            "_": "PageCaption",
                            "text": {
                                "_": "TextPlain",
                                "text": "Local residents walk past a container-housing complex for refugees, constructed within sight of the 14th century Andechs monastery © Chris Stowers/Panos Pictures Panos"
                            },
                            "credit": {
                                "_": "TextEmpty"
                            }
                        },
                        "url": null,
                        "webpage_id": null
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Companies of all sizes are spread around the country — Adidas is in Herzogenaurach near Nuremberg, BASF is in Ludwigshafen; software giant SAP is in a place called Walldorf. In the UK, I visited an electronics component plant north of Stoke in the small town of Congleton. It is run by Siemens. How many UK world-beaters are located in forgotten corners of the land? "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "Local employers in Germany are required to act as good citizens. They are not thanked for sponsoring sports teams and music clubs. It’s required of them. "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Mitmachen."
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " Loosely translated: to get stuck in. "
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Wealth is not secreted in the capital city. Unlike France or Britain, Germany is the only country where GDP per capita is lower in the capital than in the country at large. Without Berlin Germany would be 0.2 per cent richer. (By contrast, the economy of the London metropolitan area contributes a third of the economy’s entire economic output). Poor but sexy, to borrow the phrase from Berlin’s mayor more than a decade ago. It isn’t so poor any more, and it’s probably less sexy. But it still knows its mind. "
                        }
                    },
                    {
                        "_": "PageBlockPhoto",
                        "photo_id": 5986448184966228862,
                        "caption": {
                            "_": "PageCaption",
                            "text": {
                                "_": "TextEmpty"
                            },
                            "credit": {
                                "_": "TextEmpty"
                            }
                        },
                        "url": null,
                        "webpage_id": null
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Germany’s resilience has been put to the test in the day-to-day and in the big moments. In the past 30 years it has overcome a series of challenges that would have felled others. "
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "The relationship between the federal government and the"
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": " Länder"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " can be tetchy but most of the time — as the coronavirus crisis has showed — it is "
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "a considerable advantage"
                                    },
                                    "url": "https://www.ft.com/content/cc1f650a-91c0-4e1f-b990-ee8ceb5339ea",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ". The federal system is highly codified. One of the many advantages at the start of the pandemic was the ability of the "
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Länder"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": " to source equipment and to plan for emergency provision, while at the same time being able to co-ordinate with the centre."
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockHeader",
                        "text": {
                            "_": "TextPlain",
                            "text": "Recommended"
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextPlain",
                                    "text": "Review"
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Non-Fiction\n"
                                    },
                                    "url": "https://www.ft.com/non-fiction",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Why the Germans Do it Better by John Kampfner — paean to a nation"
                                    },
                                    "url": "https://www.ft.com/content/861406f2-b917-4703-8e26-6c901cee1c47",
                                    "webpage_id": 707176888991123040
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "The consensus politics that is the hallmark of postwar Germany enabled Merkel’s government to work closely with experts, wherever they were based. At the heart of it was the Robert Koch Institute. Funded by the Health Ministry but independently run, the RKI’s daily press briefing — accurate and never over-claiming — provided reassurance to a troubled nation."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Education is another key area that is devolved, but where principles are shared. Selection takes place early (too early perhaps), and pupils are put on either more academic or vocational routes. Those that go down the apprenticeship route are not looked down on (unlike in the UK and other countries). Dual studies is a highly respected scheme in which young people spend around two-thirds of their time in company placements, and a third in college. Both academic and vocational routes came under strain during Covid-19, but the problems were swiftly overcome. In contrast to the chaos in Britain, school students were able to sit their major exams in classrooms carefully organised to ensure social distancing."
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "A few months into the pandemic, ministers were regularly asked by interviewers: why can’t you do it more like the Germans? They acknowledged some of the healthcare specifics, but could not bring themselves to talk about the bigger questions. "
                        }
                    },
                    {
                        "_": "PageBlockHeader",
                        "text": {
                            "_": "TextPlain",
                            "text": "Recommended"
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Rachman Review podcast"
                                    },
                                    "url": "https://www.ft.com/rachman-review",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextPlain",
                                    "text": "25 min listen\n"
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "German diplomacy tested by multiple crises"
                                    },
                                    "url": "https://www.ft.com/content/db0c4f05-08d2-43f3-8001-2b4da82cd4c3",
                                    "webpage_id": 0
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextPlain",
                            "text": "Modern Germany does not fall back on cheap rhetoric when the chips are down. Seeing only horror, it has no past to fall back on. That is why it cares so passionately about process, about getting it right, not playing fast and loose. That is why I, like many who have a complicated relationship with the country (my Jewish father was forced to flee his native Bratislava, others in his family were murdered in the camps), so admire the seriousness with which it has managed this, and previous crises. The answer to many of our own predicaments is hiding in plain sight. But do we have the humility to see it?"
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "John Kampfner’s new book ‘"
                                    }
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextItalic",
                                        "text": {
                                            "_": "TextPlain",
                                            "text": "Why the Germans Do It Better: Notes from a Grown-Up Country"
                                        }
                                    },
                                    "url": "https://www.amazon.co.uk/gp/product/1786499754/ref=as_li_tl?ie=UTF8&tag=finantimes-21&camp=1634&creative=6738&linkCode=as2&creativeASIN=1786499754&linkId=04dda948c0a455c7ae16586f4e627b04",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "’ is published by Atlantic"
                                    }
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Follow "
                                    }
                                },
                                {
                                    "_": "TextUrl",
                                    "text": {
                                        "_": "TextItalic",
                                        "text": {
                                            "_": "TextPlain",
                                            "text": "@FTLifeArts"
                                        }
                                    },
                                    "url": "https://twitter.com/FTLifeArts",
                                    "webpage_id": 0
                                },
                                {
                                    "_": "TextItalic",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": " on Twitter to find out about our latest stories first"
                                    }
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextConcat",
                            "texts": [
                                {
                                    "_": "TextBold",
                                    "text": {
                                        "_": "TextPlain",
                                        "text": "Letter in response to this article"
                                    }
                                },
                                {
                                    "_": "TextPlain",
                                    "text": ":"
                                }
                            ]
                        }
                    },
                    {
                        "_": "PageBlockParagraph",
                        "text": {
                            "_": "TextUrl",
                            "text": {
                                "_": "TextItalic",
                                "text": {
                                    "_": "TextPlain",
                                    "text": "Britain should emulate a German style of politics / From Antony Black, University of Dundee, Scotland, UK"
                                }
                            },
                            "url": "https://www.ft.com/content/acf76f3e-6f87-4a57-ae82-48a0f0a7df9a",
                            "webpage_id": 707176889539357923
                        }
                    }
                ],
                "photos": [
                    {
                        "_": "Photo",
                        "id": 5984202943567604607,
                        "access_hash": -3886059596398887639,
                        "file_reference": "b'\\x00b\\x11\\x83 \\x82\\xfbPB/\\xf2\\x8d\\xc5\\x07\\x17\\xac\\xd8o\\x9b\\xaeD'",
                        "date": "2020-09-16 04:02:59+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b'\\x01\\x1b(\\xab0\\x1b\\x97\\x0b\\x8aiR\\x02\\xfb\\x9a<\\xcd\\xea\\xa4\\xf3\\x83H\\xd2\\x921\\xfd\\xd3\\xc7\\xf9\\xfc)\\x01c\\xca\\x8fv2\\xd5\\n\\xa72{b\\x96I\\x88v\\xc7\\x07\\x03\\x14\\xd11\\xdcp\\xbc5\\x08\\x00\\x0f\\xde\\x8c\\x8c\\xf1E4K\\xf3\\x86\\xf58\\xa2\\x80c\\xc4EA\\xec=\\x05,`)\\x1c\\x02=\\xeai\\x86\\x05D\\x9fxP\\xc6K, \\x93\\xb1@\\xe0\\x1e\\x95P\\x80\\x87o$\\x8e\\xf5~RF1TX\\x02\\xd9=h`\\x87$;\\xc8\\x03\\xebEK\\x07Z(Bg'"
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 213,
                                "size": 19445
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 700,
                                "h": 467,
                                "size": 84444
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    },
                    {
                        "_": "Photo",
                        "id": 5986735720141794195,
                        "access_hash": -2892180206784718592,
                        "file_reference": "b'\\x00b\\x11\\x83 \\xf7\\xf3z\\x93\\xb24>\\xdep1\\xac{\\x90\\x08V?'",
                        "date": "2020-09-16 04:02:59+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b'\\x01\\x1c(\\xd7\\x08\\x00\\xe3\"\\x97o\\xb9\\xfc\\xe9GJN\\xf4\\x00\\x05\\xf7?\\x9d\\x18\\xfa\\xfet\\xb4\\x1a\\x00(\\xa2\\x8a\\x00L\\x81\\xd4\\x8ag\\xde%\\x87n\\x9e\\xf4\\xf1\\xcd.(\\x01\\xbb\\xd7\\xb9\\xc7\\xd6\\x80\\xeaz\\x1c\\xfd)@\\xebK@\\x08\\x1b=\\x8f\\xe5E-\\x14\\x01'"
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 229,
                                "size": 14982
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 800,
                                "h": 572,
                                "size": 57592
                            },
                            {
                                "_": "PhotoSize",
                                "type": "y",
                                "w": 1280,
                                "h": 915,
                                "size": 105495
                            },
                            {
                                "_": "PhotoSize",
                                "type": "w",
                                "w": 1400,
                                "h": 1001,
                                "size": 117280
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    },
                    {
                        "_": "Photo",
                        "id": 5986438504109943619,
                        "access_hash": 5682911409439631587,
                        "file_reference": "b'\\x00b\\x11\\x83 \\x15et\\xb0\\xebU\\x8f\\x01\\xa8Y5?q\\x1a\\xc2\\xa4'",
                        "date": "2020-09-16 04:03:03+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b\"\\x01\\x1b(\\x83Ix\\x91\\x98\\xb8\\x05\\xbbf\\xa6\\xfb4w\\x1a\\x8eB\\xed\\x8c\\xf5\\xfa\\xd6t\\x00\\xac\\x80\\x95\\xad;{\\x81\\x1b)|}\\xe3\\xc8\\xa4RZ6g]\\xc1\\xe4N\\xcb\\x83\\x8c\\xf0j8c2H\\x16\\xb5n\\xe6Y\\xdb\\x0c\\xb8\\x0b\\xde\\xab\\xc5,1+g\\x8f\\x9b\\x82\\x00>\\xb4\\\\n6\\x8aei\\xa3\\xd99\\xa2\\x9fu i\\x01\\xc1?(\\xeb\\x8c\\xf4\\xa2\\xa9\\x19\\xea\\x17\\x07\\xe4\\xcdWW&@\\xc7\\x9ezU\\x8b\\x8f\\xf5TX\\xf5'\\xda\\xa4\\xa02\\xab\\x11\\xfb\\x81\\xd7\\xa6z\\xf3U\\xe4;\\x98\\x80\\x00\\x03\\x9cV\\x83\\x13\\xf6\\x98\\xb9\\xecj\\x8d\\xd7\\xfc|\\xc9\\xf5\\xa0\\x04\\x19b;\\xe3\\xd2\\x8a\\xb7f\\x07\\xd9\\xe4=\\xc9\\xe6\\x8a/b\\x94.\\x7f\""
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 213,
                                "size": 18714
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 700,
                                "h": 467,
                                "size": 71097
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    },
                    {
                        "_": "Photo",
                        "id": 5984330113254271883,
                        "access_hash": 5176219204956435356,
                        "file_reference": "b'\\x00b\\x11\\x83 \\xf3\\xa4\\x80^\\xba\\xa1\\x9eq\\xab\\x9d\\x1chD\\xf6q\\x85'",
                        "date": "2020-09-16 04:03:03+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b'\\x01\\x1b(\\xcf\\x9a\\xe7\\xce`|\\xb4B?\\xb81\\x9a\\x925\\x86f\\x8dcfV?x\\x91\\xc0\\xa9\\x84\\xa8\\xf2\\x01\\xb40\\xc7\\xf1%J\\xc5#U\\x7f$\\x1d\\xc3\\xf8\\x061\\xf5\\xa7d\\x05qk1\\xfb\\xcc\\xa3>\\x9djT\\xb4H\\xf9\\'q\\xfd*?<n\\x00\\x9c6z\\x1a\\x9eP\\xd1\\xc6\\x1d\\xf8\\x19\\xc1\\xf5\\x14h\\x05k\\x91\\xf9QD\\xaf\\x98\\x18\\xfd(\\xa0C-%e\\x90\\x02r\\xa7\\xf8j\\xdc\\x93\\x98\\x90\\x95\\x10\\xa1\\xea@\\x19\"\\xa9F\\x00\\xdaG\\\\\\xd3\\xd7\\x99J\\x9e\\x99\\xe9R2$\\r4\\xfb\\x8e\\t-\\x92Oz\\xd1\\x8e\\x02$$\\x90T\\xff\\x00\\x07aQD\\x8a\\x1f8\\x19\\xa9\\xf2s\\xd6\\x93cDZ\\x88\\x02%\\x18\\xe3<\\xd1K?\\xcc\\x84\\x1eh\\xa10g'"
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 213,
                                "size": 21604
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 700,
                                "h": 466,
                                "size": 82658
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    },
                    {
                        "_": "Photo",
                        "id": 5986618909916244748,
                        "access_hash": 7795445879548550474,
                        "file_reference": "b'\\x00b\\x11\\x83 s4\\xb3`h\\xc6\\xc94\\xf9\\xa0\\xe4\\xd0=\\xd1\\x1b\\x90'",
                        "date": "2020-09-16 04:03:03+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b'\\x01\\x1b(\\x99\\xa3\\x8d8+\\x92{P\"\\x18\\x1f!\\xe7\\xb6*(\\xae\\xa4\\x966\\xc0\\x8c7A\\x9e\\xa2\\x92A;\\xa0\\xcc\\x83\\x8aw\\x119\\x85F\\x06\\x0eH\\xcd0\\xc4\\xeb\\xda\\xa9\\xc9$\\xab\\x84nB\\xf4\\xf4\\xa7E4\\x8aK\\x0c\\x83\\xfaQ\\xcc\\x82\\xc4\\xaf\\x13z\\x1a([\\xe9\\x06\\xef20}8\\xc5\\x14]\\n\\xcc\\x8fc\\x7fv\\x8d\\x8d\\xfd\\xd3R`m\\xa6\\x9e+>DP\\xcd\\x9f\\xec~\\x94\\xd6\\x042\\x90x\\x1dE?sz\\x9aPI=i\\xa8\\x01\\x1a\\xb6W\\'\\xad\\x15!c\\xebEO \\xcf'"
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 213,
                                "size": 19131
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 700,
                                "h": 467,
                                "size": 91496
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    },
                    {
                        "_": "Photo",
                        "id": 5986448184966228862,
                        "access_hash": -5320232179265244021,
                        "file_reference": "b'\\x00b\\x11\\x83 R\\xea\\xa8\\x11\\xb9.{\\xd6[\\x99\\xc8S\\xf1`\\x9cz'",
                        "date": "2020-09-16 04:03:03+00:00",
                        "sizes": [
                            {
                                "_": "PhotoStrippedSize",
                                "type": "i",
                                "bytes": "b'\\x01\\x1c(\\xd5U\\xc7L\\xfe\\xa2\\x94\\x95\\x18\\xc9\\xc7\\xe2j+\\x9b\\x8f(\\x00\\xbc\\xb1 }*;\\xb3\\xfb\\xd8\\x07\\xfbc\\xf9\\x8av\\x11k\\x8f\\x7f\\xd6\\x8e?\\xda\\xfdj\\xb5\\xc3\\x03u\\x00\\x07\\xa1\\xa9\\x9ae\\x13,\\\\\\xeejV\\x19-\\x15\\x0bN\\x05\\xca\\xc3\\x8eH\\xeb\\x9a(\\x02\\xb5\\xc4\\x12<\\xacUs\\x97\\x04s\\xdb\\x02\\x95\\xe0\\x90\\xce\\x18/\\x1ef\\xee\\xbd\\xb8\\xab\\x80{\\x9a\\\\}\\x7f:|\\xc2\\xb1G\\xc8\\x93\\xcfV\\xdb\\xc0rz\\xf6\\xcd,qM\\xe7\\xc6\\xee\\t\\xc6rI\\xfa\\xe2\\xafQE\\xc2\\xc6}\\xbc\\x13,\\xd13\\xa9\\xf9A\\xdcs\\xf5\\xa2\\xb4(\\xa1\\xbb\\x8dh\\x8f'"
                            },
                            {
                                "_": "PhotoSize",
                                "type": "m",
                                "w": 320,
                                "h": 228,
                                "size": 13485
                            },
                            {
                                "_": "PhotoSize",
                                "type": "x",
                                "w": 800,
                                "h": 571,
                                "size": 43502
                            },
                            {
                                "_": "PhotoSize",
                                "type": "y",
                                "w": 1280,
                                "h": 914,
                                "size": 80618
                            },
                            {
                                "_": "PhotoSize",
                                "type": "w",
                                "w": 1400,
                                "h": 1000,
                                "size": 82474
                            }
                        ],
                        "dc_id": 4,
                        "has_stickers": false,
                        "video_sizes": []
                    }
                ],
                "documents": [],
                "part": false,
                "rtl": false,
                "v2": false,
                "views": null
            },
            "attributes": []
        }
    },
    "reply_markup": {
        "_": "ReplyInlineMarkup",
        "rows": [
            {
                "_": "KeyboardButtonRow",
                "buttons": [
                    {
                        "_": "KeyboardButtonCallback",
                        "text": "  😘",
                        "data": "b'like 22 1'",
                        "requires_password": false
                    },
                    {
                        "_": "KeyboardButtonCallback",
                        "text": " 😉 1",
                        "data": "b'like 22 2'",
                        "requires_password": false
                    },
                    {
                        "_": "KeyboardButtonCallback",
                        "text": " 😱",
                        "data": "b'like 22 3'",
                        "requires_password": false
                    },
                    {
                        "_": "KeyboardButtonUrlAuth",
                        "text": "💬",
                        "url": "https://comments.bot/thread/O8_l-kYLI",
                        "button_id": 1839146266,
                        "fwd_text": null
                    }
                ]
            }
        ]
    },
    "entities": [
        {
            "_": "MessageEntityUrl",
            "offset": 43,
            "length": 63
        }
    ],
    "views": 34,
    "forwards": 0,
    "replies": null,
    "edit_date": "2020-09-16 16:19:32+00:00",
    "post_author": "Markt Mai",
    "grouped_id": null,
    "restriction_reason": [],
    "ttl_period": null,
    "tags": []
}